apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_wcl_core.h
/****************************************************************************
 * arch/xtensa/src/esp32s3/hardware/esp32s3_wcl_core.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_XTENSA_SRC_ESP32S3_HARDWARE_ESP32S3_WCL_CORE_H
#define __ARCH_XTENSA_SRC_ESP32S3_HARDWARE_ESP32S3_WCL_CORE_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include "esp32s3_soc.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* WCL_CORE_0_ENTRY_1_ADDR_REG register
 * Core_0 Entry 1 address configuration Register
 */

#define WCL_CORE_0_ENTRY_1_ADDR_REG (DR_REG_WORLD_CNTL_BASE + 0x0)

/* WCL_CORE_0_ENTRY_1_ADDR : R/W; bitpos: [31:0]; default: 0;
 * Core_0 Entry 1 address from WORLD1 to WORLD0
 */

#define WCL_CORE_0_ENTRY_1_ADDR    0xffffffff
#define WCL_CORE_0_ENTRY_1_ADDR_M  (WCL_CORE_0_ENTRY_1_ADDR_V << WCL_CORE_0_ENTRY_1_ADDR_S)
#define WCL_CORE_0_ENTRY_1_ADDR_V  0xffffffff
#define WCL_CORE_0_ENTRY_1_ADDR_S  0

/* WCL_CORE_0_ENTRY_2_ADDR_REG register
 * Core_0 Entry 2 address configuration Register
 */

#define WCL_CORE_0_ENTRY_2_ADDR_REG (DR_REG_WORLD_CNTL_BASE + 0x4)

/* WCL_CORE_0_ENTRY_2_ADDR : R/W; bitpos: [31:0]; default: 0;
 * Core_0 Entry 2 address from WORLD1 to WORLD0
 */

#define WCL_CORE_0_ENTRY_2_ADDR    0xffffffff
#define WCL_CORE_0_ENTRY_2_ADDR_M  (WCL_CORE_0_ENTRY_2_ADDR_V << WCL_CORE_0_ENTRY_2_ADDR_S)
#define WCL_CORE_0_ENTRY_2_ADDR_V  0xffffffff
#define WCL_CORE_0_ENTRY_2_ADDR_S  0

/* WCL_CORE_0_ENTRY_3_ADDR_REG register
 * Core_0 Entry 3 address configuration Register
 */

#define WCL_CORE_0_ENTRY_3_ADDR_REG (DR_REG_WORLD_CNTL_BASE + 0x8)

/* WCL_CORE_0_ENTRY_3_ADDR : R/W; bitpos: [31:0]; default: 0;
 * Core_0 Entry 3 address from WORLD1 to WORLD0
 */

#define WCL_CORE_0_ENTRY_3_ADDR    0xffffffff
#define WCL_CORE_0_ENTRY_3_ADDR_M  (WCL_CORE_0_ENTRY_3_ADDR_V << WCL_CORE_0_ENTRY_3_ADDR_S)
#define WCL_CORE_0_ENTRY_3_ADDR_V  0xffffffff
#define WCL_CORE_0_ENTRY_3_ADDR_S  0

/* WCL_CORE_0_ENTRY_4_ADDR_REG register
 * Core_0 Entry 4 address configuration Register
 */

#define WCL_CORE_0_ENTRY_4_ADDR_REG (DR_REG_WORLD_CNTL_BASE + 0xc)

/* WCL_CORE_0_ENTRY_4_ADDR : R/W; bitpos: [31:0]; default: 0;
 * Core_0 Entry 4 address from WORLD1 to WORLD0
 */

#define WCL_CORE_0_ENTRY_4_ADDR    0xffffffff
#define WCL_CORE_0_ENTRY_4_ADDR_M  (WCL_CORE_0_ENTRY_4_ADDR_V << WCL_CORE_0_ENTRY_4_ADDR_S)
#define WCL_CORE_0_ENTRY_4_ADDR_V  0xffffffff
#define WCL_CORE_0_ENTRY_4_ADDR_S  0

/* WCL_CORE_0_ENTRY_5_ADDR_REG register
 * Core_0 Entry 5 address configuration Register
 */

#define WCL_CORE_0_ENTRY_5_ADDR_REG (DR_REG_WORLD_CNTL_BASE + 0x10)

/* WCL_CORE_0_ENTRY_5_ADDR : R/W; bitpos: [31:0]; default: 0;
 * Core_0 Entry 5 address from WORLD1 to WORLD0
 */

#define WCL_CORE_0_ENTRY_5_ADDR    0xffffffff
#define WCL_CORE_0_ENTRY_5_ADDR_M  (WCL_CORE_0_ENTRY_5_ADDR_V << WCL_CORE_0_ENTRY_5_ADDR_S)
#define WCL_CORE_0_ENTRY_5_ADDR_V  0xffffffff
#define WCL_CORE_0_ENTRY_5_ADDR_S  0

/* WCL_CORE_0_ENTRY_6_ADDR_REG register
 * Core_0 Entry 6 address configuration Register
 */

#define WCL_CORE_0_ENTRY_6_ADDR_REG (DR_REG_WORLD_CNTL_BASE + 0x14)

/* WCL_CORE_0_ENTRY_6_ADDR : R/W; bitpos: [31:0]; default: 0;
 * Core_0 Entry 6 address from WORLD1 to WORLD0
 */

#define WCL_CORE_0_ENTRY_6_ADDR    0xffffffff
#define WCL_CORE_0_ENTRY_6_ADDR_M  (WCL_CORE_0_ENTRY_6_ADDR_V << WCL_CORE_0_ENTRY_6_ADDR_S)
#define WCL_CORE_0_ENTRY_6_ADDR_V  0xffffffff
#define WCL_CORE_0_ENTRY_6_ADDR_S  0

/* WCL_CORE_0_ENTRY_7_ADDR_REG register
 * Core_0 Entry 7 address configuration Register
 */

#define WCL_CORE_0_ENTRY_7_ADDR_REG (DR_REG_WORLD_CNTL_BASE + 0x18)

/* WCL_CORE_0_ENTRY_7_ADDR : R/W; bitpos: [31:0]; default: 0;
 * Core_0 Entry 7 address from WORLD1 to WORLD0
 */

#define WCL_CORE_0_ENTRY_7_ADDR    0xffffffff
#define WCL_CORE_0_ENTRY_7_ADDR_M  (WCL_CORE_0_ENTRY_7_ADDR_V << WCL_CORE_0_ENTRY_7_ADDR_S)
#define WCL_CORE_0_ENTRY_7_ADDR_V  0xffffffff
#define WCL_CORE_0_ENTRY_7_ADDR_S  0

/* WCL_CORE_0_ENTRY_8_ADDR_REG register
 * Core_0 Entry 8 address configuration Register
 */

#define WCL_CORE_0_ENTRY_8_ADDR_REG (DR_REG_WORLD_CNTL_BASE + 0x1c)

/* WCL_CORE_0_ENTRY_8_ADDR : R/W; bitpos: [31:0]; default: 0;
 * Core_0 Entry 8 address from WORLD1 to WORLD0
 */

#define WCL_CORE_0_ENTRY_8_ADDR    0xffffffff
#define WCL_CORE_0_ENTRY_8_ADDR_M  (WCL_CORE_0_ENTRY_8_ADDR_V << WCL_CORE_0_ENTRY_8_ADDR_S)
#define WCL_CORE_0_ENTRY_8_ADDR_V  0xffffffff
#define WCL_CORE_0_ENTRY_8_ADDR_S  0

/* WCL_CORE_0_ENTRY_9_ADDR_REG register
 * Core_0 Entry 9 address configuration Register
 */

#define WCL_CORE_0_ENTRY_9_ADDR_REG (DR_REG_WORLD_CNTL_BASE + 0x20)

/* WCL_CORE_0_ENTRY_9_ADDR : R/W; bitpos: [31:0]; default: 0;
 * Core_0 Entry 9 address from WORLD1 to WORLD0
 */

#define WCL_CORE_0_ENTRY_9_ADDR    0xffffffff
#define WCL_CORE_0_ENTRY_9_ADDR_M  (WCL_CORE_0_ENTRY_9_ADDR_V << WCL_CORE_0_ENTRY_9_ADDR_S)
#define WCL_CORE_0_ENTRY_9_ADDR_V  0xffffffff
#define WCL_CORE_0_ENTRY_9_ADDR_S  0

/* WCL_CORE_0_ENTRY_10_ADDR_REG register
 * Core_0 Entry 10 address configuration Register
 */

#define WCL_CORE_0_ENTRY_10_ADDR_REG (DR_REG_WORLD_CNTL_BASE + 0x24)

/* WCL_CORE_0_ENTRY_10_ADDR : R/W; bitpos: [31:0]; default: 0;
 * Core_0 Entry 10 address from WORLD1 to WORLD0
 */

#define WCL_CORE_0_ENTRY_10_ADDR    0xffffffff
#define WCL_CORE_0_ENTRY_10_ADDR_M  (WCL_CORE_0_ENTRY_10_ADDR_V << WCL_CORE_0_ENTRY_10_ADDR_S)
#define WCL_CORE_0_ENTRY_10_ADDR_V  0xffffffff
#define WCL_CORE_0_ENTRY_10_ADDR_S  0

/* WCL_CORE_0_ENTRY_11_ADDR_REG register
 * Core_0 Entry 11 address configuration Register
 */

#define WCL_CORE_0_ENTRY_11_ADDR_REG (DR_REG_WORLD_CNTL_BASE + 0x28)

/* WCL_CORE_0_ENTRY_11_ADDR : R/W; bitpos: [31:0]; default: 0;
 * Core_0 Entry 11 address from WORLD1 to WORLD0
 */

#define WCL_CORE_0_ENTRY_11_ADDR    0xffffffff
#define WCL_CORE_0_ENTRY_11_ADDR_M  (WCL_CORE_0_ENTRY_11_ADDR_V << WCL_CORE_0_ENTRY_11_ADDR_S)
#define WCL_CORE_0_ENTRY_11_ADDR_V  0xffffffff
#define WCL_CORE_0_ENTRY_11_ADDR_S  0

/* WCL_CORE_0_ENTRY_12_ADDR_REG register
 * Core_0 Entry 12 address configuration Register
 */

#define WCL_CORE_0_ENTRY_12_ADDR_REG (DR_REG_WORLD_CNTL_BASE + 0x2c)

