apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_wcl_core.h
/* WCL_CORE_0_FROM_WORLD_5 : R/W; bitpos: [0]; default: 0;
 * This bit is used to confirm world before enter entry 5
 */

#define WCL_CORE_0_FROM_WORLD_5    (BIT(0))
#define WCL_CORE_0_FROM_WORLD_5_M  (WCL_CORE_0_FROM_WORLD_5_V << WCL_CORE_0_FROM_WORLD_5_S)
#define WCL_CORE_0_FROM_WORLD_5_V  0x00000001
#define WCL_CORE_0_FROM_WORLD_5_S  0

/* WCL_CORE_0_STATUSTABLE6_REG register
 * Status register of world switch of entry 6
 */

#define WCL_CORE_0_STATUSTABLE6_REG (DR_REG_WORLD_CNTL_BASE + 0x94)

/* WCL_CORE_0_CURRENT_6 : R/W; bitpos: [5]; default: 0;
 * This bit is used to confirm whether the current state is in entry 6
 */

#define WCL_CORE_0_CURRENT_6    (BIT(5))
#define WCL_CORE_0_CURRENT_6_M  (WCL_CORE_0_CURRENT_6_V << WCL_CORE_0_CURRENT_6_S)
#define WCL_CORE_0_CURRENT_6_V  0x00000001
#define WCL_CORE_0_CURRENT_6_S  5

/* WCL_CORE_0_FROM_ENTRY_6 : R/W; bitpos: [4:1]; default: 0;
 * This filed is used to confirm in which entry before enter entry 6
 */

#define WCL_CORE_0_FROM_ENTRY_6    0x0000000f
#define WCL_CORE_0_FROM_ENTRY_6_M  (WCL_CORE_0_FROM_ENTRY_6_V << WCL_CORE_0_FROM_ENTRY_6_S)
#define WCL_CORE_0_FROM_ENTRY_6_V  0x0000000f
#define WCL_CORE_0_FROM_ENTRY_6_S  1

/* WCL_CORE_0_FROM_WORLD_6 : R/W; bitpos: [0]; default: 0;
 * This bit is used to confirm world before enter entry 6
 */

#define WCL_CORE_0_FROM_WORLD_6    (BIT(0))
#define WCL_CORE_0_FROM_WORLD_6_M  (WCL_CORE_0_FROM_WORLD_6_V << WCL_CORE_0_FROM_WORLD_6_S)
#define WCL_CORE_0_FROM_WORLD_6_V  0x00000001
#define WCL_CORE_0_FROM_WORLD_6_S  0

/* WCL_CORE_0_STATUSTABLE7_REG register
 * Status register of world switch of entry 7
 */

#define WCL_CORE_0_STATUSTABLE7_REG (DR_REG_WORLD_CNTL_BASE + 0x98)

/* WCL_CORE_0_CURRENT_7 : R/W; bitpos: [5]; default: 0;
 * This bit is used to confirm whether the current state is in entry 7
 */

#define WCL_CORE_0_CURRENT_7    (BIT(5))
#define WCL_CORE_0_CURRENT_7_M  (WCL_CORE_0_CURRENT_7_V << WCL_CORE_0_CURRENT_7_S)
#define WCL_CORE_0_CURRENT_7_V  0x00000001
#define WCL_CORE_0_CURRENT_7_S  5

/* WCL_CORE_0_FROM_ENTRY_7 : R/W; bitpos: [4:1]; default: 0;
 * This filed is used to confirm in which entry before enter entry 7
 */

#define WCL_CORE_0_FROM_ENTRY_7    0x0000000f
#define WCL_CORE_0_FROM_ENTRY_7_M  (WCL_CORE_0_FROM_ENTRY_7_V << WCL_CORE_0_FROM_ENTRY_7_S)
#define WCL_CORE_0_FROM_ENTRY_7_V  0x0000000f
#define WCL_CORE_0_FROM_ENTRY_7_S  1

/* WCL_CORE_0_FROM_WORLD_7 : R/W; bitpos: [0]; default: 0;
 * This bit is used to confirm world before enter entry 7
 */

#define WCL_CORE_0_FROM_WORLD_7    (BIT(0))
#define WCL_CORE_0_FROM_WORLD_7_M  (WCL_CORE_0_FROM_WORLD_7_V << WCL_CORE_0_FROM_WORLD_7_S)
#define WCL_CORE_0_FROM_WORLD_7_V  0x00000001
#define WCL_CORE_0_FROM_WORLD_7_S  0

/* WCL_CORE_0_STATUSTABLE8_REG register
 * Status register of world switch of entry 8
 */

#define WCL_CORE_0_STATUSTABLE8_REG (DR_REG_WORLD_CNTL_BASE + 0x9c)

/* WCL_CORE_0_CURRENT_8 : R/W; bitpos: [5]; default: 0;
 * This bit is used to confirm whether the current state is in entry 8
 */

#define WCL_CORE_0_CURRENT_8    (BIT(5))
#define WCL_CORE_0_CURRENT_8_M  (WCL_CORE_0_CURRENT_8_V << WCL_CORE_0_CURRENT_8_S)
#define WCL_CORE_0_CURRENT_8_V  0x00000001
#define WCL_CORE_0_CURRENT_8_S  5

/* WCL_CORE_0_FROM_ENTRY_8 : R/W; bitpos: [4:1]; default: 0;
 * This filed is used to confirm in which entry before enter entry 8
 */

#define WCL_CORE_0_FROM_ENTRY_8    0x0000000f
#define WCL_CORE_0_FROM_ENTRY_8_M  (WCL_CORE_0_FROM_ENTRY_8_V << WCL_CORE_0_FROM_ENTRY_8_S)
#define WCL_CORE_0_FROM_ENTRY_8_V  0x0000000f
#define WCL_CORE_0_FROM_ENTRY_8_S  1

/* WCL_CORE_0_FROM_WORLD_8 : R/W; bitpos: [0]; default: 0;
 * This bit is used to confirm world before enter entry 8
 */

#define WCL_CORE_0_FROM_WORLD_8    (BIT(0))
#define WCL_CORE_0_FROM_WORLD_8_M  (WCL_CORE_0_FROM_WORLD_8_V << WCL_CORE_0_FROM_WORLD_8_S)
#define WCL_CORE_0_FROM_WORLD_8_V  0x00000001
#define WCL_CORE_0_FROM_WORLD_8_S  0

/* WCL_CORE_0_STATUSTABLE9_REG register
 * Status register of world switch of entry 9
 */

#define WCL_CORE_0_STATUSTABLE9_REG (DR_REG_WORLD_CNTL_BASE + 0xa0)

/* WCL_CORE_0_CURRENT_9 : R/W; bitpos: [5]; default: 0;
 * This bit is used to confirm whether the current state is in entry 9
 */

#define WCL_CORE_0_CURRENT_9    (BIT(5))
#define WCL_CORE_0_CURRENT_9_M  (WCL_CORE_0_CURRENT_9_V << WCL_CORE_0_CURRENT_9_S)
#define WCL_CORE_0_CURRENT_9_V  0x00000001
#define WCL_CORE_0_CURRENT_9_S  5

/* WCL_CORE_0_FROM_ENTRY_9 : R/W; bitpos: [4:1]; default: 0;
 * This filed is used to confirm in which entry before enter entry 9
 */

#define WCL_CORE_0_FROM_ENTRY_9    0x0000000f
#define WCL_CORE_0_FROM_ENTRY_9_M  (WCL_CORE_0_FROM_ENTRY_9_V << WCL_CORE_0_FROM_ENTRY_9_S)
#define WCL_CORE_0_FROM_ENTRY_9_V  0x0000000f
#define WCL_CORE_0_FROM_ENTRY_9_S  1

/* WCL_CORE_0_FROM_WORLD_9 : R/W; bitpos: [0]; default: 0;
 * This bit is used to confirm world before enter entry 9
 */

#define WCL_CORE_0_FROM_WORLD_9    (BIT(0))
#define WCL_CORE_0_FROM_WORLD_9_M  (WCL_CORE_0_FROM_WORLD_9_V << WCL_CORE_0_FROM_WORLD_9_S)
#define WCL_CORE_0_FROM_WORLD_9_V  0x00000001
#define WCL_CORE_0_FROM_WORLD_9_S  0

/* WCL_CORE_0_STATUSTABLE10_REG register
 * Status register of world switch of entry 10
 */

#define WCL_CORE_0_STATUSTABLE10_REG (DR_REG_WORLD_CNTL_BASE + 0xa4)

/* WCL_CORE_0_CURRENT_10 : R/W; bitpos: [5]; default: 0;
 * This bit is used to confirm whether the current state is in entry 10
 */

#define WCL_CORE_0_CURRENT_10    (BIT(5))
#define WCL_CORE_0_CURRENT_10_M  (WCL_CORE_0_CURRENT_10_V << WCL_CORE_0_CURRENT_10_S)
#define WCL_CORE_0_CURRENT_10_V  0x00000001
#define WCL_CORE_0_CURRENT_10_S  5

/* WCL_CORE_0_FROM_ENTRY_10 : R/W; bitpos: [4:1]; default: 0;
 * This filed is used to confirm in which entry before enter entry 10
 */

#define WCL_CORE_0_FROM_ENTRY_10    0x0000000f
#define WCL_CORE_0_FROM_ENTRY_10_M  (WCL_CORE_0_FROM_ENTRY_10_V << WCL_CORE_0_FROM_ENTRY_10_S)
#define WCL_CORE_0_FROM_ENTRY_10_V  0x0000000f
#define WCL_CORE_0_FROM_ENTRY_10_S  1

/* WCL_CORE_0_FROM_WORLD_10 : R/W; bitpos: [0]; default: 0;
 * This bit is used to confirm world before enter entry 10
 */

#define WCL_CORE_0_FROM_WORLD_10    (BIT(0))
#define WCL_CORE_0_FROM_WORLD_10_M  (WCL_CORE_0_FROM_WORLD_10_V << WCL_CORE_0_FROM_WORLD_10_S)
#define WCL_CORE_0_FROM_WORLD_10_V  0x00000001
#define WCL_CORE_0_FROM_WORLD_10_S  0

/* WCL_CORE_0_STATUSTABLE11_REG register
 * Status register of world switch of entry 11
 */

#define WCL_CORE_0_STATUSTABLE11_REG (DR_REG_WORLD_CNTL_BASE + 0xa8)

