apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_wcl_core.h
/* WCL_CORE_0_NMI_MASK_DISABLE_REG register
 * Core_0 NMI mask disable register
 */

#define WCL_CORE_0_NMI_MASK_DISABLE_REG (DR_REG_WORLD_CNTL_BASE + 0x188)

/* WCL_CORE_0_NMI_MASK_DISABLE : WO; bitpos: [31:0]; default: 0;
 * this field is used to disable NMI mask,it will not take effect
 * immediately,only when the CPU executes to the trigger address will it
 * start to cancel NMI mask
 */

#define WCL_CORE_0_NMI_MASK_DISABLE    0xffffffff
#define WCL_CORE_0_NMI_MASK_DISABLE_M  (WCL_CORE_0_NMI_MASK_DISABLE_V << WCL_CORE_0_NMI_MASK_DISABLE_S)
#define WCL_CORE_0_NMI_MASK_DISABLE_V  0xffffffff
#define WCL_CORE_0_NMI_MASK_DISABLE_S  0

/* WCL_CORE_0_NMI_MASK_CANCLE_REG register
 * Core_0 NMI mask disable register
 */

#define WCL_CORE_0_NMI_MASK_CANCLE_REG (DR_REG_WORLD_CNTL_BASE + 0x18c)

/* WCL_CORE_0_NMI_MASK_CANCEL : WO; bitpos: [31:0]; default: 0;
 * this field is used to cancel NMI mask disable function.
 */

#define WCL_CORE_0_NMI_MASK_CANCEL    0xffffffff
#define WCL_CORE_0_NMI_MASK_CANCEL_M  (WCL_CORE_0_NMI_MASK_CANCEL_V << WCL_CORE_0_NMI_MASK_CANCEL_S)
#define WCL_CORE_0_NMI_MASK_CANCEL_V  0xffffffff
#define WCL_CORE_0_NMI_MASK_CANCEL_S  0

/* WCL_CORE_0_NMI_MASK_REG register
 * Core_0 NMI mask register
 */

#define WCL_CORE_0_NMI_MASK_REG (DR_REG_WORLD_CNTL_BASE + 0x190)

/* WCL_CORE_0_NMI_MASK : R/W; bitpos: [0]; default: 0;
 * this bit is used to mask NMI interrupt,it can directly mask NMI interrupt
 */

#define WCL_CORE_0_NMI_MASK    (BIT(0))
#define WCL_CORE_0_NMI_MASK_M  (WCL_CORE_0_NMI_MASK_V << WCL_CORE_0_NMI_MASK_S)
#define WCL_CORE_0_NMI_MASK_V  0x00000001
#define WCL_CORE_0_NMI_MASK_S  0

/* WCL_CORE_0_NMI_MASK_PHASE_REG register
 * Core_0 NMI mask phase register
 */

#define WCL_CORE_0_NMI_MASK_PHASE_REG (DR_REG_WORLD_CNTL_BASE + 0x194)

/* WCL_CORE_0_NMI_MASK_PHASE : RO; bitpos: [0]; default: 0;
 * this bit is used to indicates whether the NMI interrupt is being masked,
 * 1 means NMI interrupt is being masked
 */

#define WCL_CORE_0_NMI_MASK_PHASE    (BIT(0))
#define WCL_CORE_0_NMI_MASK_PHASE_M  (WCL_CORE_0_NMI_MASK_PHASE_V << WCL_CORE_0_NMI_MASK_PHASE_S)
#define WCL_CORE_0_NMI_MASK_PHASE_V  0x00000001
#define WCL_CORE_0_NMI_MASK_PHASE_S  0

/* WCL_CORE_1_ENTRY_1_ADDR_REG register
 * Core_1 Entry 1 address configuration Register
 */

#define WCL_CORE_1_ENTRY_1_ADDR_REG (DR_REG_WORLD_CNTL_BASE + 0x400)

/* WCL_CORE_1_ENTRY_1_ADDR : R/W; bitpos: [31:0]; default: 0;
 * Core_1 Entry 1 address from WORLD1 to WORLD0
 */

#define WCL_CORE_1_ENTRY_1_ADDR    0xffffffff
#define WCL_CORE_1_ENTRY_1_ADDR_M  (WCL_CORE_1_ENTRY_1_ADDR_V << WCL_CORE_1_ENTRY_1_ADDR_S)
#define WCL_CORE_1_ENTRY_1_ADDR_V  0xffffffff
#define WCL_CORE_1_ENTRY_1_ADDR_S  0

/* WCL_CORE_1_ENTRY_2_ADDR_REG register
 * Core_1 Entry 2 address configuration Register
 */

#define WCL_CORE_1_ENTRY_2_ADDR_REG (DR_REG_WORLD_CNTL_BASE + 0x404)

/* WCL_CORE_1_ENTRY_2_ADDR : R/W; bitpos: [31:0]; default: 0;
 * Core_1 Entry 2 address from WORLD1 to WORLD0
 */

#define WCL_CORE_1_ENTRY_2_ADDR    0xffffffff
#define WCL_CORE_1_ENTRY_2_ADDR_M  (WCL_CORE_1_ENTRY_2_ADDR_V << WCL_CORE_1_ENTRY_2_ADDR_S)
#define WCL_CORE_1_ENTRY_2_ADDR_V  0xffffffff
#define WCL_CORE_1_ENTRY_2_ADDR_S  0

/* WCL_CORE_1_ENTRY_3_ADDR_REG register
 * Core_1 Entry 3 address configuration Register
 */

#define WCL_CORE_1_ENTRY_3_ADDR_REG (DR_REG_WORLD_CNTL_BASE + 0x408)

/* WCL_CORE_1_ENTRY_3_ADDR : R/W; bitpos: [31:0]; default: 0;
 * Core_1 Entry 3 address from WORLD1 to WORLD0
 */

#define WCL_CORE_1_ENTRY_3_ADDR    0xffffffff
#define WCL_CORE_1_ENTRY_3_ADDR_M  (WCL_CORE_1_ENTRY_3_ADDR_V << WCL_CORE_1_ENTRY_3_ADDR_S)
#define WCL_CORE_1_ENTRY_3_ADDR_V  0xffffffff
#define WCL_CORE_1_ENTRY_3_ADDR_S  0

/* WCL_CORE_1_ENTRY_4_ADDR_REG register
 * Core_1 Entry 4 address configuration Register
 */

#define WCL_CORE_1_ENTRY_4_ADDR_REG (DR_REG_WORLD_CNTL_BASE + 0x40c)

/* WCL_CORE_1_ENTRY_4_ADDR : R/W; bitpos: [31:0]; default: 0;
 * Core_1 Entry 4 address from WORLD1 to WORLD0
 */

#define WCL_CORE_1_ENTRY_4_ADDR    0xffffffff
#define WCL_CORE_1_ENTRY_4_ADDR_M  (WCL_CORE_1_ENTRY_4_ADDR_V << WCL_CORE_1_ENTRY_4_ADDR_S)
#define WCL_CORE_1_ENTRY_4_ADDR_V  0xffffffff
#define WCL_CORE_1_ENTRY_4_ADDR_S  0

/* WCL_CORE_1_ENTRY_5_ADDR_REG register
 * Core_1 Entry 5 address configuration Register
 */

#define WCL_CORE_1_ENTRY_5_ADDR_REG (DR_REG_WORLD_CNTL_BASE + 0x410)

/* WCL_CORE_1_ENTRY_5_ADDR : R/W; bitpos: [31:0]; default: 0;
 * Core_1 Entry 5 address from WORLD1 to WORLD0
 */

#define WCL_CORE_1_ENTRY_5_ADDR    0xffffffff
#define WCL_CORE_1_ENTRY_5_ADDR_M  (WCL_CORE_1_ENTRY_5_ADDR_V << WCL_CORE_1_ENTRY_5_ADDR_S)
#define WCL_CORE_1_ENTRY_5_ADDR_V  0xffffffff
#define WCL_CORE_1_ENTRY_5_ADDR_S  0

/* WCL_CORE_1_ENTRY_6_ADDR_REG register
 * Core_1 Entry 6 address configuration Register
 */

#define WCL_CORE_1_ENTRY_6_ADDR_REG (DR_REG_WORLD_CNTL_BASE + 0x414)

/* WCL_CORE_1_ENTRY_6_ADDR : R/W; bitpos: [31:0]; default: 0;
 * Core_1 Entry 6 address from WORLD1 to WORLD0
 */

#define WCL_CORE_1_ENTRY_6_ADDR    0xffffffff
#define WCL_CORE_1_ENTRY_6_ADDR_M  (WCL_CORE_1_ENTRY_6_ADDR_V << WCL_CORE_1_ENTRY_6_ADDR_S)
#define WCL_CORE_1_ENTRY_6_ADDR_V  0xffffffff
#define WCL_CORE_1_ENTRY_6_ADDR_S  0

/* WCL_CORE_1_ENTRY_7_ADDR_REG register
 * Core_1 Entry 7 address configuration Register
 */

#define WCL_CORE_1_ENTRY_7_ADDR_REG (DR_REG_WORLD_CNTL_BASE + 0x418)

/* WCL_CORE_1_ENTRY_7_ADDR : R/W; bitpos: [31:0]; default: 0;
 * Core_1 Entry 7 address from WORLD1 to WORLD0
 */

#define WCL_CORE_1_ENTRY_7_ADDR    0xffffffff
#define WCL_CORE_1_ENTRY_7_ADDR_M  (WCL_CORE_1_ENTRY_7_ADDR_V << WCL_CORE_1_ENTRY_7_ADDR_S)
#define WCL_CORE_1_ENTRY_7_ADDR_V  0xffffffff
#define WCL_CORE_1_ENTRY_7_ADDR_S  0

/* WCL_CORE_1_ENTRY_8_ADDR_REG register
 * Core_1 Entry 8 address configuration Register
 */

#define WCL_CORE_1_ENTRY_8_ADDR_REG (DR_REG_WORLD_CNTL_BASE + 0x41c)

/* WCL_CORE_1_ENTRY_8_ADDR : R/W; bitpos: [31:0]; default: 0;
 * Core_1 Entry 8 address from WORLD1 to WORLD0
 */

#define WCL_CORE_1_ENTRY_8_ADDR    0xffffffff
#define WCL_CORE_1_ENTRY_8_ADDR_M  (WCL_CORE_1_ENTRY_8_ADDR_V << WCL_CORE_1_ENTRY_8_ADDR_S)
#define WCL_CORE_1_ENTRY_8_ADDR_V  0xffffffff
#define WCL_CORE_1_ENTRY_8_ADDR_S  0

/* WCL_CORE_1_ENTRY_9_ADDR_REG register
 * Core_1 Entry 9 address configuration Register
 */

