apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_wcl_core.h
#define WCL_CORE_1_ENTRY_9_ADDR_REG (DR_REG_WORLD_CNTL_BASE + 0x420)

/* WCL_CORE_1_ENTRY_9_ADDR : R/W; bitpos: [31:0]; default: 0;
 * Core_1 Entry 9 address from WORLD1 to WORLD0
 */

#define WCL_CORE_1_ENTRY_9_ADDR    0xffffffff
#define WCL_CORE_1_ENTRY_9_ADDR_M  (WCL_CORE_1_ENTRY_9_ADDR_V << WCL_CORE_1_ENTRY_9_ADDR_S)
#define WCL_CORE_1_ENTRY_9_ADDR_V  0xffffffff
#define WCL_CORE_1_ENTRY_9_ADDR_S  0

/* WCL_CORE_1_ENTRY_10_ADDR_REG register
 * Core_1 Entry 10 address configuration Register
 */

#define WCL_CORE_1_ENTRY_10_ADDR_REG (DR_REG_WORLD_CNTL_BASE + 0x424)

/* WCL_CORE_1_ENTRY_10_ADDR : R/W; bitpos: [31:0]; default: 0;
 * Core_1 Entry 10 address from WORLD1 to WORLD0
 */

#define WCL_CORE_1_ENTRY_10_ADDR    0xffffffff
#define WCL_CORE_1_ENTRY_10_ADDR_M  (WCL_CORE_1_ENTRY_10_ADDR_V << WCL_CORE_1_ENTRY_10_ADDR_S)
#define WCL_CORE_1_ENTRY_10_ADDR_V  0xffffffff
#define WCL_CORE_1_ENTRY_10_ADDR_S  0

/* WCL_CORE_1_ENTRY_11_ADDR_REG register
 * Core_1 Entry 11 address configuration Register
 */

#define WCL_CORE_1_ENTRY_11_ADDR_REG (DR_REG_WORLD_CNTL_BASE + 0x428)

/* WCL_CORE_1_ENTRY_11_ADDR : R/W; bitpos: [31:0]; default: 0;
 * Core_1 Entry 11 address from WORLD1 to WORLD0
 */

#define WCL_CORE_1_ENTRY_11_ADDR    0xffffffff
#define WCL_CORE_1_ENTRY_11_ADDR_M  (WCL_CORE_1_ENTRY_11_ADDR_V << WCL_CORE_1_ENTRY_11_ADDR_S)
#define WCL_CORE_1_ENTRY_11_ADDR_V  0xffffffff
#define WCL_CORE_1_ENTRY_11_ADDR_S  0

/* WCL_CORE_1_ENTRY_12_ADDR_REG register
 * Core_1 Entry 12 address configuration Register
 */

#define WCL_CORE_1_ENTRY_12_ADDR_REG (DR_REG_WORLD_CNTL_BASE + 0x42c)

/* WCL_CORE_1_ENTRY_12_ADDR : R/W; bitpos: [31:0]; default: 0;
 * Core_1 Entry 12 address from WORLD1 to WORLD0
 */

#define WCL_CORE_1_ENTRY_12_ADDR    0xffffffff
#define WCL_CORE_1_ENTRY_12_ADDR_M  (WCL_CORE_1_ENTRY_12_ADDR_V << WCL_CORE_1_ENTRY_12_ADDR_S)
#define WCL_CORE_1_ENTRY_12_ADDR_V  0xffffffff
#define WCL_CORE_1_ENTRY_12_ADDR_S  0

/* WCL_CORE_1_ENTRY_13_ADDR_REG register
 * Core_1 Entry 13 address configuration Register
 */

#define WCL_CORE_1_ENTRY_13_ADDR_REG (DR_REG_WORLD_CNTL_BASE + 0x430)

/* WCL_CORE_1_ENTRY_13_ADDR : R/W; bitpos: [31:0]; default: 0;
 * Core_1 Entry 13 address from WORLD1 to WORLD0
 */

#define WCL_CORE_1_ENTRY_13_ADDR    0xffffffff
#define WCL_CORE_1_ENTRY_13_ADDR_M  (WCL_CORE_1_ENTRY_13_ADDR_V << WCL_CORE_1_ENTRY_13_ADDR_S)
#define WCL_CORE_1_ENTRY_13_ADDR_V  0xffffffff
#define WCL_CORE_1_ENTRY_13_ADDR_S  0

/* WCL_CORE_1_ENTRY_CHECK_REG register
 * Core_1 Entry check configuration Register
 */

#define WCL_CORE_1_ENTRY_CHECK_REG (DR_REG_WORLD_CNTL_BASE + 0x47c)

/* WCL_CORE_1_ENTRY_CHECK : R/W; bitpos: [13:1]; default: 1;
 * This filed is used to enable entry address check
 */

#define WCL_CORE_1_ENTRY_CHECK    0x00001fff
#define WCL_CORE_1_ENTRY_CHECK_M  (WCL_CORE_1_ENTRY_CHECK_V << WCL_CORE_1_ENTRY_CHECK_S)
#define WCL_CORE_1_ENTRY_CHECK_V  0x00001fff
#define WCL_CORE_1_ENTRY_CHECK_S  1

/* WCL_CORE_1_STATUSTABLE1_REG register
 * Status register of world switch of entry 1
 */

#define WCL_CORE_1_STATUSTABLE1_REG (DR_REG_WORLD_CNTL_BASE + 0x480)

/* WCL_CORE_1_CURRENT_1 : R/W; bitpos: [5]; default: 0;
 * This bit is used to confirm whether the current state is in entry 1
 */

#define WCL_CORE_1_CURRENT_1    (BIT(5))
#define WCL_CORE_1_CURRENT_1_M  (WCL_CORE_1_CURRENT_1_V << WCL_CORE_1_CURRENT_1_S)
#define WCL_CORE_1_CURRENT_1_V  0x00000001
#define WCL_CORE_1_CURRENT_1_S  5

/* WCL_CORE_1_FROM_ENTRY_1 : R/W; bitpos: [4:1]; default: 0;
 * This filed is used to confirm in which entry before enter entry 1
 */

#define WCL_CORE_1_FROM_ENTRY_1    0x0000000f
#define WCL_CORE_1_FROM_ENTRY_1_M  (WCL_CORE_1_FROM_ENTRY_1_V << WCL_CORE_1_FROM_ENTRY_1_S)
#define WCL_CORE_1_FROM_ENTRY_1_V  0x0000000f
#define WCL_CORE_1_FROM_ENTRY_1_S  1

/* WCL_CORE_1_FROM_WORLD_1 : R/W; bitpos: [0]; default: 0;
 * This bit is used to confirm world before enter entry 1
 */

#define WCL_CORE_1_FROM_WORLD_1    (BIT(0))
#define WCL_CORE_1_FROM_WORLD_1_M  (WCL_CORE_1_FROM_WORLD_1_V << WCL_CORE_1_FROM_WORLD_1_S)
#define WCL_CORE_1_FROM_WORLD_1_V  0x00000001
#define WCL_CORE_1_FROM_WORLD_1_S  0

/* WCL_CORE_1_STATUSTABLE2_REG register
 * Status register of world switch of entry 2
 */

#define WCL_CORE_1_STATUSTABLE2_REG (DR_REG_WORLD_CNTL_BASE + 0x484)

/* WCL_CORE_1_CURRENT_2 : R/W; bitpos: [5]; default: 0;
 * This bit is used to confirm whether the current state is in entry 2
 */

#define WCL_CORE_1_CURRENT_2    (BIT(5))
#define WCL_CORE_1_CURRENT_2_M  (WCL_CORE_1_CURRENT_2_V << WCL_CORE_1_CURRENT_2_S)
#define WCL_CORE_1_CURRENT_2_V  0x00000001
#define WCL_CORE_1_CURRENT_2_S  5

/* WCL_CORE_1_FROM_ENTRY_2 : R/W; bitpos: [4:1]; default: 0;
 * This filed is used to confirm in which entry before enter entry 2
 */

#define WCL_CORE_1_FROM_ENTRY_2    0x0000000f
#define WCL_CORE_1_FROM_ENTRY_2_M  (WCL_CORE_1_FROM_ENTRY_2_V << WCL_CORE_1_FROM_ENTRY_2_S)
#define WCL_CORE_1_FROM_ENTRY_2_V  0x0000000f
#define WCL_CORE_1_FROM_ENTRY_2_S  1

/* WCL_CORE_1_FROM_WORLD_2 : R/W; bitpos: [0]; default: 0;
 * This bit is used to confirm world before enter entry 2
 */

#define WCL_CORE_1_FROM_WORLD_2    (BIT(0))
#define WCL_CORE_1_FROM_WORLD_2_M  (WCL_CORE_1_FROM_WORLD_2_V << WCL_CORE_1_FROM_WORLD_2_S)
#define WCL_CORE_1_FROM_WORLD_2_V  0x00000001
#define WCL_CORE_1_FROM_WORLD_2_S  0

/* WCL_CORE_1_STATUSTABLE3_REG register
 * Status register of world switch of entry 3
 */

#define WCL_CORE_1_STATUSTABLE3_REG (DR_REG_WORLD_CNTL_BASE + 0x488)

/* WCL_CORE_1_CURRENT_3 : R/W; bitpos: [5]; default: 0;
 * This bit is used to confirm whether the current state is in entry 3
 */

#define WCL_CORE_1_CURRENT_3    (BIT(5))
#define WCL_CORE_1_CURRENT_3_M  (WCL_CORE_1_CURRENT_3_V << WCL_CORE_1_CURRENT_3_S)
#define WCL_CORE_1_CURRENT_3_V  0x00000001
#define WCL_CORE_1_CURRENT_3_S  5

/* WCL_CORE_1_FROM_ENTRY_3 : R/W; bitpos: [4:1]; default: 0;
 * This filed is used to confirm in which entry before enter entry 3
 */

#define WCL_CORE_1_FROM_ENTRY_3    0x0000000f
#define WCL_CORE_1_FROM_ENTRY_3_M  (WCL_CORE_1_FROM_ENTRY_3_V << WCL_CORE_1_FROM_ENTRY_3_S)
#define WCL_CORE_1_FROM_ENTRY_3_V  0x0000000f
#define WCL_CORE_1_FROM_ENTRY_3_S  1

/* WCL_CORE_1_FROM_WORLD_3 : R/W; bitpos: [0]; default: 0;
 * This bit is used to confirm world before enter entry 3
 */

#define WCL_CORE_1_FROM_WORLD_3    (BIT(0))
#define WCL_CORE_1_FROM_WORLD_3_M  (WCL_CORE_1_FROM_WORLD_3_V << WCL_CORE_1_FROM_WORLD_3_S)
#define WCL_CORE_1_FROM_WORLD_3_V  0x00000001
#define WCL_CORE_1_FROM_WORLD_3_S  0

/* WCL_CORE_1_STATUSTABLE4_REG register
 * Status register of world switch of entry 4
 */

#define WCL_CORE_1_STATUSTABLE4_REG (DR_REG_WORLD_CNTL_BASE + 0x48c)

/* WCL_CORE_1_CURRENT_4 : R/W; bitpos: [5]; default: 0;
 * This bit is used to confirm whether the current state is in entry 4
 */

#define WCL_CORE_1_CURRENT_4    (BIT(5))
#define WCL_CORE_1_CURRENT_4_M  (WCL_CORE_1_CURRENT_4_V << WCL_CORE_1_CURRENT_4_S)
#define WCL_CORE_1_CURRENT_4_V  0x00000001
#define WCL_CORE_1_CURRENT_4_S  5

/* WCL_CORE_1_FROM_ENTRY_4 : R/W; bitpos: [4:1]; default: 0;
 * This filed is used to confirm in which entry before enter entry 4
 */

#define WCL_CORE_1_FROM_ENTRY_4    0x0000000f
#define WCL_CORE_1_FROM_ENTRY_4_M  (WCL_CORE_1_FROM_ENTRY_4_V << WCL_CORE_1_FROM_ENTRY_4_S)
#define WCL_CORE_1_FROM_ENTRY_4_V  0x0000000f
#define WCL_CORE_1_FROM_ENTRY_4_S  1

