apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_wcl_core.h
#define WCL_CORE_1_STATUSTABLE10_REG (DR_REG_WORLD_CNTL_BASE + 0x4a4)

/* WCL_CORE_1_CURRENT_10 : R/W; bitpos: [5]; default: 0;
 * This bit is used to confirm whether the current state is in entry 10
 */

#define WCL_CORE_1_CURRENT_10    (BIT(5))
#define WCL_CORE_1_CURRENT_10_M  (WCL_CORE_1_CURRENT_10_V << WCL_CORE_1_CURRENT_10_S)
#define WCL_CORE_1_CURRENT_10_V  0x00000001
#define WCL_CORE_1_CURRENT_10_S  5

/* WCL_CORE_1_FROM_ENTRY_10 : R/W; bitpos: [4:1]; default: 0;
 * This filed is used to confirm in which entry before enter entry 10
 */

#define WCL_CORE_1_FROM_ENTRY_10    0x0000000f
#define WCL_CORE_1_FROM_ENTRY_10_M  (WCL_CORE_1_FROM_ENTRY_10_V << WCL_CORE_1_FROM_ENTRY_10_S)
#define WCL_CORE_1_FROM_ENTRY_10_V  0x0000000f
#define WCL_CORE_1_FROM_ENTRY_10_S  1

/* WCL_CORE_1_FROM_WORLD_10 : R/W; bitpos: [0]; default: 0;
 * This bit is used to confirm world before enter entry 10
 */

#define WCL_CORE_1_FROM_WORLD_10    (BIT(0))
#define WCL_CORE_1_FROM_WORLD_10_M  (WCL_CORE_1_FROM_WORLD_10_V << WCL_CORE_1_FROM_WORLD_10_S)
#define WCL_CORE_1_FROM_WORLD_10_V  0x00000001
#define WCL_CORE_1_FROM_WORLD_10_S  0

/* WCL_CORE_1_STATUSTABLE11_REG register
 * Status register of world switch of entry 11
 */

#define WCL_CORE_1_STATUSTABLE11_REG (DR_REG_WORLD_CNTL_BASE + 0x4a8)

/* WCL_CORE_1_CURRENT_11 : R/W; bitpos: [5]; default: 0;
 * This bit is used to confirm whether the current state is in entry 11
 */

#define WCL_CORE_1_CURRENT_11    (BIT(5))
#define WCL_CORE_1_CURRENT_11_M  (WCL_CORE_1_CURRENT_11_V << WCL_CORE_1_CURRENT_11_S)
#define WCL_CORE_1_CURRENT_11_V  0x00000001
#define WCL_CORE_1_CURRENT_11_S  5

/* WCL_CORE_1_FROM_ENTRY_11 : R/W; bitpos: [4:1]; default: 0;
 * This filed is used to confirm in which entry before enter entry 11
 */

#define WCL_CORE_1_FROM_ENTRY_11    0x0000000f
#define WCL_CORE_1_FROM_ENTRY_11_M  (WCL_CORE_1_FROM_ENTRY_11_V << WCL_CORE_1_FROM_ENTRY_11_S)
#define WCL_CORE_1_FROM_ENTRY_11_V  0x0000000f
#define WCL_CORE_1_FROM_ENTRY_11_S  1

/* WCL_CORE_1_FROM_WORLD_11 : R/W; bitpos: [0]; default: 0;
 * This bit is used to confirm world before enter entry 11
 */

#define WCL_CORE_1_FROM_WORLD_11    (BIT(0))
#define WCL_CORE_1_FROM_WORLD_11_M  (WCL_CORE_1_FROM_WORLD_11_V << WCL_CORE_1_FROM_WORLD_11_S)
#define WCL_CORE_1_FROM_WORLD_11_V  0x00000001
#define WCL_CORE_1_FROM_WORLD_11_S  0

/* WCL_CORE_1_STATUSTABLE12_REG register
 * Status register of world switch of entry 12
 */

#define WCL_CORE_1_STATUSTABLE12_REG (DR_REG_WORLD_CNTL_BASE + 0x4ac)

/* WCL_CORE_1_CURRENT_12 : R/W; bitpos: [5]; default: 0;
 * This bit is used to confirm whether the current state is in entry 12
 */

#define WCL_CORE_1_CURRENT_12    (BIT(5))
#define WCL_CORE_1_CURRENT_12_M  (WCL_CORE_1_CURRENT_12_V << WCL_CORE_1_CURRENT_12_S)
#define WCL_CORE_1_CURRENT_12_V  0x00000001
#define WCL_CORE_1_CURRENT_12_S  5

/* WCL_CORE_1_FROM_ENTRY_12 : R/W; bitpos: [4:1]; default: 0;
 * This filed is used to confirm in which entry before enter entry 12
 */

#define WCL_CORE_1_FROM_ENTRY_12    0x0000000f
#define WCL_CORE_1_FROM_ENTRY_12_M  (WCL_CORE_1_FROM_ENTRY_12_V << WCL_CORE_1_FROM_ENTRY_12_S)
#define WCL_CORE_1_FROM_ENTRY_12_V  0x0000000f
#define WCL_CORE_1_FROM_ENTRY_12_S  1

/* WCL_CORE_1_FROM_WORLD_12 : R/W; bitpos: [0]; default: 0;
 * This bit is used to confirm world before enter entry 12
 */

#define WCL_CORE_1_FROM_WORLD_12    (BIT(0))
#define WCL_CORE_1_FROM_WORLD_12_M  (WCL_CORE_1_FROM_WORLD_12_V << WCL_CORE_1_FROM_WORLD_12_S)
#define WCL_CORE_1_FROM_WORLD_12_V  0x00000001
#define WCL_CORE_1_FROM_WORLD_12_S  0

/* WCL_CORE_1_STATUSTABLE13_REG register
 * Status register of world switch of entry 13
 */

#define WCL_CORE_1_STATUSTABLE13_REG (DR_REG_WORLD_CNTL_BASE + 0x4b0)

/* WCL_CORE_1_CURRENT_13 : R/W; bitpos: [5]; default: 0;
 * This bit is used to confirm whether the current state is in entry 13
 */

#define WCL_CORE_1_CURRENT_13    (BIT(5))
#define WCL_CORE_1_CURRENT_13_M  (WCL_CORE_1_CURRENT_13_V << WCL_CORE_1_CURRENT_13_S)
#define WCL_CORE_1_CURRENT_13_V  0x00000001
#define WCL_CORE_1_CURRENT_13_S  5

/* WCL_CORE_1_FROM_ENTRY_13 : R/W; bitpos: [4:1]; default: 0;
 * This filed is used to confirm in which entry before enter entry 13
 */

#define WCL_CORE_1_FROM_ENTRY_13    0x0000000f
#define WCL_CORE_1_FROM_ENTRY_13_M  (WCL_CORE_1_FROM_ENTRY_13_V << WCL_CORE_1_FROM_ENTRY_13_S)
#define WCL_CORE_1_FROM_ENTRY_13_V  0x0000000f
#define WCL_CORE_1_FROM_ENTRY_13_S  1

/* WCL_CORE_1_FROM_WORLD_13 : R/W; bitpos: [0]; default: 0;
 * This bit is used to confirm world before enter entry 13
 */

#define WCL_CORE_1_FROM_WORLD_13    (BIT(0))
#define WCL_CORE_1_FROM_WORLD_13_M  (WCL_CORE_1_FROM_WORLD_13_V << WCL_CORE_1_FROM_WORLD_13_S)
#define WCL_CORE_1_FROM_WORLD_13_V  0x00000001
#define WCL_CORE_1_FROM_WORLD_13_S  0

/* WCL_CORE_1_STATUSTABLE_CURRENT_REG register
 * Status register of statustable current
 */

#define WCL_CORE_1_STATUSTABLE_CURRENT_REG (DR_REG_WORLD_CNTL_BASE + 0x4fc)

/* WCL_CORE_1_STATUSTABLE_CURRENT : R/W; bitpos: [13:1]; default: 0;
 * This field is used to quickly read and rewrite the current field of all
 * STATUSTABLE registers,for example,bit 1 represents the current field of
 * STATUSTABLE1
 */

#define WCL_CORE_1_STATUSTABLE_CURRENT    0x00001fff
#define WCL_CORE_1_STATUSTABLE_CURRENT_M  (WCL_CORE_1_STATUSTABLE_CURRENT_V << WCL_CORE_1_STATUSTABLE_CURRENT_S)
#define WCL_CORE_1_STATUSTABLE_CURRENT_V  0x00001fff
#define WCL_CORE_1_STATUSTABLE_CURRENT_S  1

/* WCL_CORE_1_MESSAGE_ADDR_REG register
 * Clear writer_buffer write address configuration register
 */

#define WCL_CORE_1_MESSAGE_ADDR_REG (DR_REG_WORLD_CNTL_BASE + 0x500)

/* WCL_CORE_1_MESSAGE_ADDR : R/W; bitpos: [31:0]; default: 0;
 * This field is used to set address that need to write when enter WORLD0
 */

#define WCL_CORE_1_MESSAGE_ADDR    0xffffffff
#define WCL_CORE_1_MESSAGE_ADDR_M  (WCL_CORE_1_MESSAGE_ADDR_V << WCL_CORE_1_MESSAGE_ADDR_S)
#define WCL_CORE_1_MESSAGE_ADDR_V  0xffffffff
#define WCL_CORE_1_MESSAGE_ADDR_S  0

