apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_wcl_core.h
#define WCL_CORE_1_NMI_MASK_ENABLE_REG (DR_REG_WORLD_CNTL_BASE + 0x580)

/* WCL_CORE_1_NMI_MASK_ENABLE : WO; bitpos: [31:0]; default: 0;
 * this field is used to set NMI mask, it can write any value, when write
 * this register,the hardware start masking NMI interrupt
 */

#define WCL_CORE_1_NMI_MASK_ENABLE    0xffffffff
#define WCL_CORE_1_NMI_MASK_ENABLE_M  (WCL_CORE_1_NMI_MASK_ENABLE_V << WCL_CORE_1_NMI_MASK_ENABLE_S)
#define WCL_CORE_1_NMI_MASK_ENABLE_V  0xffffffff
#define WCL_CORE_1_NMI_MASK_ENABLE_S  0

/* WCL_CORE_1_NMI_MASK_TRIGGER_ADDR_REG register
 * Core_1 NMI mask trigger addr register
 */

#define WCL_CORE_1_NMI_MASK_TRIGGER_ADDR_REG (DR_REG_WORLD_CNTL_BASE + 0x584)

/* WCL_CORE_1_NMI_MASK_TRIGGER_ADDR : R/W; bitpos: [31:0]; default: 0;
 * this field to used to set trigger address
 */

#define WCL_CORE_1_NMI_MASK_TRIGGER_ADDR    0xffffffff
#define WCL_CORE_1_NMI_MASK_TRIGGER_ADDR_M  (WCL_CORE_1_NMI_MASK_TRIGGER_ADDR_V << WCL_CORE_1_NMI_MASK_TRIGGER_ADDR_S)
#define WCL_CORE_1_NMI_MASK_TRIGGER_ADDR_V  0xffffffff
#define WCL_CORE_1_NMI_MASK_TRIGGER_ADDR_S  0

/* WCL_CORE_1_NMI_MASK_DISABLE_REG register
 * Core_1 NMI mask disable register
 */

#define WCL_CORE_1_NMI_MASK_DISABLE_REG (DR_REG_WORLD_CNTL_BASE + 0x588)

/* WCL_CORE_1_NMI_MASK_DISABLE : WO; bitpos: [31:0]; default: 0;
 * this field is used to disable NMI mask, it will not take effect
 * immediately,only when the CPU executes to the trigger address will it
 * start to cancel NMI mask
 */

#define WCL_CORE_1_NMI_MASK_DISABLE    0xffffffff
#define WCL_CORE_1_NMI_MASK_DISABLE_M  (WCL_CORE_1_NMI_MASK_DISABLE_V << WCL_CORE_1_NMI_MASK_DISABLE_S)
#define WCL_CORE_1_NMI_MASK_DISABLE_V  0xffffffff
#define WCL_CORE_1_NMI_MASK_DISABLE_S  0

/* WCL_CORE_1_NMI_MASK_CANCLE_REG register
 * Core_1 NMI mask disable register
 */

#define WCL_CORE_1_NMI_MASK_CANCLE_REG (DR_REG_WORLD_CNTL_BASE + 0x58c)

/* WCL_CORE_1_NMI_MASK_CANCEL : WO; bitpos: [31:0]; default: 0;
 * this field is used to cancel NMI mask disable function.
 */

#define WCL_CORE_1_NMI_MASK_CANCEL    0xffffffff
#define WCL_CORE_1_NMI_MASK_CANCEL_M  (WCL_CORE_1_NMI_MASK_CANCEL_V << WCL_CORE_1_NMI_MASK_CANCEL_S)
#define WCL_CORE_1_NMI_MASK_CANCEL_V  0xffffffff
#define WCL_CORE_1_NMI_MASK_CANCEL_S  0

/* WCL_CORE_1_NMI_MASK_REG register
 * Core_1 NMI mask register
 */

#define WCL_CORE_1_NMI_MASK_REG (DR_REG_WORLD_CNTL_BASE + 0x590)

/* WCL_CORE_1_NMI_MASK : R/W; bitpos: [0]; default: 0;
 * this bit is used to mask NMI interrupt,it can directly mask NMI interrupt
 */

#define WCL_CORE_1_NMI_MASK    (BIT(0))
#define WCL_CORE_1_NMI_MASK_M  (WCL_CORE_1_NMI_MASK_V << WCL_CORE_1_NMI_MASK_S)
#define WCL_CORE_1_NMI_MASK_V  0x00000001
#define WCL_CORE_1_NMI_MASK_S  0

/* WCL_CORE_1_NMI_MASK_PHASE_REG register
 * Core_1 NMI mask phase register
 */

#define WCL_CORE_1_NMI_MASK_PHASE_REG (DR_REG_WORLD_CNTL_BASE + 0x594)

/* WCL_CORE_1_NMI_MASK_PHASE : RO; bitpos: [0]; default: 0;
 * this bit is used to indicates whether the NMI interrupt is being masked,
 * 1 means NMI interrupt is being masked
 */

#define WCL_CORE_1_NMI_MASK_PHASE    (BIT(0))
#define WCL_CORE_1_NMI_MASK_PHASE_M  (WCL_CORE_1_NMI_MASK_PHASE_V << WCL_CORE_1_NMI_MASK_PHASE_S)
#define WCL_CORE_1_NMI_MASK_PHASE_V  0x00000001
#define WCL_CORE_1_NMI_MASK_PHASE_S  0

#endif /* __ARCH_XTENSA_SRC_ESP32S3_HARDWARE_ESP32S3_WCL_CORE_H */
